Revit 2024 API
ElectricalSetting.WireConduitTypes Property
 Get electrical conduit types information of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WireConduitTypeSet WireConduitTypes { get; }
Visual Basic
Public ReadOnly Property WireConduitTypes As WireConduitTypeSet
	Get
Visual C++
public:
property WireConduitTypeSet^ WireConduitTypes {
	WireConduitTypeSet^ get ();
}
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace